## Staging Plan for s3_scan_object
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 19 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_sns_publish will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_sns_publish"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.scan_complete will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scan_complete"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:AddPermission",
              + "sns:DeleteTopic",
              + "sns:GetTopicAttributes",
              + "sns:ListSubscriptionsByTopic",
              + "sns:Publish",
              + "sns:Receive",
              + "sns:RemovePermission",
              + "sns:SetTopicAttributes",
              + "sns:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AccountOwnerFullAdmin"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::127893201980:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowScanFilesPublish"

          + principals {
              + identifiers = [
                  + "",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.sns_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sns_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::127893201980:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:GenerateDataKey*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "",
                ]
              + type        = "AWS"
            }
          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_ecr_repository.s3_scan_object will be created
  + resource "aws_ecr_repository" "s3_scan_object" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "scan-files/module/s3-scan-object"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_policy.api_sns_publish will be created
  + resource "aws_iam_policy" "api_sns_publish" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "scan-files-sns-publish"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.api_sns_publish will be created
  + resource "aws_iam_role_policy_attachment" "api_sns_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_kms_key.sns_lambda will be created
  + resource "aws_kms_key" "sns_lambda" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for Lambda SNS topic"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_permission.s3_scan_object_org_account_execute will be created
  + resource "aws_lambda_permission" "s3_scan_object_org_account_execute" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "s3-scan-object"
      + id                  = (known after apply)
      + principal           = "*"
      + principal_org_id    = (sensitive)
      + statement_id        = "AllowExecutionFromOrgAccounts"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.scan_complete will be created
  + resource "aws_lambda_permission" "scan_complete" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "s3-scan-object"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "S3ScanObjectSNSInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_sns_topic.scan_complete will be created
  + resource "aws_sns_topic" "scan_complete" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "s3-scan-object-complete"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic_policy.scan_complete will be created
  + resource "aws_sns_topic_policy" "scan_complete" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sns_topic_subscription.scan_complete will be created
  + resource "aws_sns_topic_subscription" "scan_complete" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.s3_scan_object.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.s3_scan_object.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/s3-scan-object"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_object.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "s3-scan-object_non_vpc"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_object.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "s3-scan-object-0"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = ""
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_object.aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "s3-scan-object-1"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_object.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3-scan-object"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.s3_scan_object.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3-scan-object"
    }

  # module.s3_scan_object.aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3-scan-object"
    }

  # module.s3_scan_object.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "s3-scan-object"
    }

  # module.s3_scan_object.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "s3-scan-object"
    }

  # module.s3_scan_object.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "s3-scan-object"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 3
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
